In [1]:
import pandas as pd
import numpy as np

Series = value + index

In [2]:
s = pd.Series([9999,7777,6666,4444],
             index = ['서울','부산','인천','대구'])
s

서울    9999
부산    7777
인천    6666
대구    4444
dtype: int64

인덱스를 지정하지 않으면 Series의 인덱스는 0부터 시작

In [3]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [4]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [5]:
s.values

array([9999, 7777, 6666, 4444], dtype=int64)

In [8]:
s.name = "인구"
s.index.name = '도시'
s

도시
서울    9999
부산    7777
인천    6666
대구    4444
Name: 인구, dtype: int64

## 시리즈 인덱싱

In [10]:
s

도시
서울    9999
부산    7777
인천    6666
대구    4444
Name: 인구, dtype: int64

In [13]:
s[0], s['서울']

(9999, 9999)

In [15]:
s[[0,3]]

도시
서울    9999
대구    4444
Name: 인구, dtype: int64

인구수가 5000명 미만이거나 8000명 이상인 도시

In [18]:
s[(s<5000) | (s>8000)]

도시
서울    9999
대구    4444
Name: 인구, dtype: int64

In [19]:
s

도시
서울    9999
부산    7777
인천    6666
대구    4444
Name: 인구, dtype: int64

In [20]:
s[0:2]

도시
서울    9999
부산    7777
Name: 인구, dtype: int64

## 딕셔너리 자료형

In [21]:
"인천" in s

True

In [22]:
s

도시
서울    9999
부산    7777
인천    6666
대구    4444
Name: 인구, dtype: int64

In [23]:
for k, v in s.items():
    print('%s = %d' %(k,v))

서울 = 9999
부산 = 7777
인천 = 6666
대구 = 4444

딕셔너리 자료형으로 시리즈 만들기

In [24]:
s2 = pd.Series({'서울':9999, '부산':7777, '인천':6666, '대구':4444})
s2

서울    9999
부산    7777
인천    6666
대구    4444
dtype: int64

In [26]:
s2.keys()

Index(['서울', '부산', '인천', '대구'], dtype='object')

딕셔너리는 순서를 가지지 않는다. 순서지정을 하려면 인덱스를 리스트로 지정

In [36]:
s3 = pd.Series({'서울':9999, '부산':7777, '인천':6666, '대구':4444},
            index=['인천','서울','부산','대구'])
s3

인천    6666
서울    9999
부산    7777
대구    4444
dtype: int64

In [40]:
s2.values

array([9999, 7777, 6666, 4444], dtype=int64)

## 데이터 추가, 삭제

In [41]:
s3

인천    6666
서울    9999
부산    7777
대구    4444
dtype: int64

In [42]:
s3['인천'] = 10000
s3

인천    10000
서울     9999
부산     7777
대구     4444
dtype: int64

삭제

In [43]:
del s3['부산']
s3

인천    10000
서울     9999
대구     4444
dtype: int64

## 데이터프레임 클래스

In [53]:
data = {
    "2015" :[123098, 234987, 345987, 234987, 435876],
    "2016" :[234987, 234764, 987435, 857493, 329474],
    "2017" :[124987, 234786, 876543, 987658, 234234],
    "2018" :[123345, 374653, 647453, 263749, 123434],
    "지역" :['수도권', '경상권', '수도권', '경상권', '전라권'],
    "2015-2018 증가율" :[0.023, 0.423, 0.032, 0.234, 0.065]
} 
index = ["서울","부산","인천","대구","광주"]
columns = ["지역", "2015","2016","2017","2018","2015-2018 증가율"]
df = pd.DataFrame(data, index = index, columns = columns)
df

     지역    2015    2016    2017    2018  2015-2018 증가율
서울  수도권  123098  234987  124987  123345          0.023
부산  경상권  234987  234764  234786  374653          0.423
인천  수도권  345987  987435  876543  647453          0.032
대구  경상권  234987  857493  987658  263749          0.234
광주  전라권  435876  329474  234234  123434          0.065

In [54]:
df.index

Index(['서울', '부산', '인천', '대구', '광주'], dtype='object')

In [55]:
df.values

array([['수도권', 123098, 234987, 124987, 123345, 0.023],
       ['경상권', 234987, 234764, 234786, 374653, 0.423],
       ['수도권', 345987, 987435, 876543, 647453, 0.032],
       ['경상권', 234987, 857493, 987658, 263749, 0.234],
       ['전라권', 435876, 329474, 234234, 123434, 0.065]], dtype=object)

In [56]:
df.columns

Index(['지역', '2015', '2016', '2017', '2018', '2015-2018 증가율'], dtype='object')

In [59]:
df.index.name = '도시'
df.columns.name = '특성'
df

특성   지역    2015    2016    2017    2018  2015-2018 증가율
도시
서울  수도권  123098  234987  124987  123345          0.023
부산  경상권  234987  234764  234786  374653          0.423
인천  수도권  345987  987435  876543  647453          0.032
대구  경상권  234987  857493  987658  263749          0.234
광주  전라권  435876  329474  234234  123434          0.065

In [72]:
data1 = {
    "국어":[90,80,88,77,55],
    "영어":[40,50,99,100,40],
    "수학":[30,40,50,60,80],
    "음악":[90,80,88,76,56],
    "미술":[98,76,56,45,86],
    "지역":['서울', '인천','부산','대구','광주'],
    "개인평균":[93.6,82.2,82.4,82.8,86.4]    
}
index = ['김','이','박','최','강']
columns = ['지역', '국어','수학','영어', '음악','미술','개인평균']
data1

{'국어': [90, 80, 88, 77, 55],
 '영어': [40, 50, 99, 100, 40],
 '수학': [30, 40, 50, 60, 80],
 '음악': [90, 80, 88, 76, 56],
 '미술': [98, 76, 56, 45, 86],
 '지역': ['서울', '인천', '부산', '대구', '광주'],
 '개인평균': [93.6, 82.2, 82.4, 82.8, 86.4]}

In [73]:
df1 = pd.DataFrame(data1, index=index, columns=columns)
df1

   지역  국어  수학   영어  음악  미술  개인평균
김  서울  90  30   40  90  98  93.6
이  인천  80  40   50  80  76  82.2
박  부산  88  50   99  88  56  82.4
최  대구  77  60  100  76  45  82.8
강  광주  55  80   40  56  86  86.4

In [74]:
df1['총점'] = df1['국어']+df1['수학']+df1['영어']+df1['음악']+df1['미술']
df1

   지역  국어  수학   영어  음악  미술  개인평균   총점
김  서울  90  30   40  90  98  93.6  348
이  인천  80  40   50  80  76  82.2  326
박  부산  88  50   99  88  56  82.4  381
최  대구  77  60  100  76  45  82.8  358
강  광주  55  80   40  56  86  86.4  317

In [85]:
df1.sort_values(by='총점')

   지역  국어  수학   영어  음악  미술  개인평균   총점
강  광주  55  80   40  56  86  86.4  317
이  인천  80  40   50  80  76  82.2  326
김  서울  90  30   40  90  98  93.6  348
최  대구  77  60  100  76  45  82.8  358
박  부산  88  50   99  88  56  82.4  381